УТ_для_edt/src/Catalogs/смартКонструкторОборудования/смартКонструкторОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартКонструкторОборудования</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнаяКонфигурация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматПринтера</name>
    <type>
      <types>CatalogRef.смартФорматыПринтеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологияПечати</name>
    <type>
      <types>CatalogRef.смартТехнологииПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаПечати</name>
    <type>
      <types>CatalogRef.смартШиринаПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.смартВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатающаяГоловка</name>
    <type>
      <types>CatalogRef.смартПечатающиеГоловки</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.смартКонструкторОборудованияПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Инфо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинкиПечатающейГоловки</name>
    <type>
      <types>CatalogRef.смартКонструкторОборудованияПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеАкции</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГарантияНаПечатающиеГоловки</name>
    <comment>//++ #Б-3154 смарт: Фролов 22.04.2025 //Доработки НСИ Конструктора КП.</comment>
    <type>
      <types>CatalogRef.смартГарантийныеСрокиНаОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантияНаОборудование</name>
    <comment>//++ #Б-3154 смарт: Фролов 22.04.2025 //Доработки НСИ Конструктора КП.</comment>
    <type>
      <types>CatalogRef.смартГарантийныеСрокиНаОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКаретки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияПоКаретке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конструктор</name>
    <comment>//++ #Б-3502 смарт: Фролов 06.06.2025 //Доработка НСИ Конструктора КП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновныеФишки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Применения</name>
    <attributes>
      <name>Применяется</name>
      <type>
        <types>CatalogRef.смартПроизводимаяПродукция</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеОпции</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.смартКонструкторОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСсылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>//++ #Б-6536 смарт: Фролов 17.04.2026 //Доработки объектов Конструктора КП.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВключатьВЦенуОсновногоТовара</name>
      <comment>//++ #Б-6536 смарт: Фролов 17.04.2026 //Доработки объектов Конструктора КП.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопутствующиеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.смартКонструкторОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСсылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолезныеМатериалы</name>
    <attributes>
      <name>ВидМатериала</name>
      <type>
        <types>CatalogRef.смартПолезнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСсылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦветовыеСхемы</name>
    <attributes>
      <name>ЦветоваяСхема</name>
      <type>
        <types>CatalogRef.смартЦветовыеКонфигурации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозможенГлянец</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлянецОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГлянецДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БезГлянцаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БезГлянцаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПечатающиеГоловки</name>
    <attributes>
      <name>ПечатающаяГоловка</name>
      <type>
        <types>CatalogRef.смартПечатающиеГоловки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.смартВидыМатериалов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Гарантия</name>
    <comment>//++ #Б-3094 смарт: Фролов 21.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВключеноВСтоимость</name>
    <comment>//++ #Б-3094 смарт: Фролов 21.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НашиПреимущества</name>
    <comment>//++ #Б-3094 смарт: Фролов 21.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеХарактеристики</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СмартФильтрыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.СмартФильтрыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекомендуемыеЧернила</name>
    <attributes>
      <name>Чернила</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СмартДопФильтрыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечатающаяГоловка</name>
      <comment>//++ #Б-4310 смарт: Фролов 10.09.2025 //Доработки Конструктора КП.</comment>
      <type>
        <types>CatalogRef.смартПечатающиеГоловки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Шаблоны</name>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>CatalogRef.смартШаблоныДанныхКонструктора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <comment>//++ #Б-4770 смарт: Фролов 20.10.2025 //Доработка справочника Конструктор оборудования.</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Чернила</name>
    <comment>//++ #Б-5656 смарт: Фролов 09.02.2026 //Доработка справочников для проекта DEERAY</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/СмартЗначенияСвойствФильтров/СмартЗначенияСвойствФильтров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СмартЗначенияСвойствФильтров</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.СмартФильтрыНоменклатуры</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвойств</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СмартФильтрыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/смартКонструкторОборудования/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();
		
		Если Параметры.Свойство("Номенклатура") Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			Объект.Номенклатура = Параметры.Номенклатура;
			Объект.Наименование = Объект.Номенклатура.Наименование;
			Объект.Бренд = Объект.Номенклатура.Марка;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("НаборСвойств", Объект.Номенклатура);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СмартЗначенияСвойствФильтров.Значение КАК Значение,
			|	СмартЗначенияСвойствФильтров.ЗначениеСтрока КАК ЗначениеСтрока,
			|	СмартЗначенияСвойствФильтров.ВидСвойств КАК ВидСвойств,
			|	СмартЗначенияСвойствФильтров.ВидСвойств.Множественное КАК Множественное
			|ИЗ
			|	РегистрСведений.СмартЗначенияСвойствФильтров КАК СмартЗначенияСвойствФильтров
			|ГДЕ
			|	СмартЗначенияСвойствФильтров.НаборСвойств = &НаборСвойств
			|	И СмартЗначенияСвойствФильтров.ВидСвойств.Код В (""000000002"", ""000000054"", ""000000006"", ""000000083"", ""000000024"")";
			
			ТЗ = Новый ТаблицаЗначений;
			ТЗ.Колонки.Добавить("ВидСвойств", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СмартФильтрыНоменклатуры"));
			ТЗ.Колонки.Добавить("Значение", Новый ОписаниеТипов("СправочникСсылка.СмартДопФильтрыНоменклатуры"));
			ТЗ.Колонки.Добавить("ЗначениеСтрока", ОбщегоНазначения.ОписаниеТипаСтрока(100));
			ТЗ.Колонки.Добавить("Множественное", Новый ОписаниеТипов("Булево"));
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Множественное Тогда
					
					МассивЗначений = СтрРазделить(Выборка.ЗначениеСтрока, ";");
					Для каждого стрЗначение Из МассивЗначений Цикл
						
						НоваяСтрока = ТЗ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "ВидСвойств,Множественное");
						НоваяСтрока.ЗначениеСтрока = стрЗначение;
						
					КонецЦикла;
					
				Иначе
					
					НоваяСтрока = ТЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Запрос.УстановитьПараметр("ТЗ", ТЗ);
			Запрос.Текст = "ВЫБРАТЬ
			               |	Т.ВидСвойств КАК ВидСвойств,
			               |	Т.Значение КАК Значение,
			               |	Т.ЗначениеСтрока КАК ЗначениеСтрока,
			               |	Т.Множественное КАК Множественное
			               |ПОМЕСТИТЬ ВТТЗ
			               |ИЗ
			               |	&ТЗ КАК Т
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ВТТЗ.ВидСвойств КАК ВидСвойств,
			               |	ВЫБОР
			               |		КОГДА ВТТЗ.Множественное
			               |			ТОГДА ЕСТЬNULL(СмартДопФильтрыНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СмартДопФильтрыНоменклатуры.ПустаяСсылка))
			               |		ИНАЧЕ ВТТЗ.Значение
			               |	КОНЕЦ КАК Значение
			               |ПОМЕСТИТЬ ВТЗначенияФильтров
			               |ИЗ
			               |	ВТТЗ КАК ВТТЗ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СмартДопФильтрыНоменклатуры КАК СмартДопФильтрыНоменклатуры
			               |		ПО ВТТЗ.ВидСвойств = СмартДопФильтрыНоменклатуры.Владелец
			               |			И ВТТЗ.ЗначениеСтрока = СмартДопФильтрыНоменклатуры.Наименование
			               |			И (ВТТЗ.Множественное)
			               |ГДЕ
			               |	ВЫБОР
			               |			КОГДА ВТТЗ.Множественное
			               |				ТОГДА ЕСТЬNULL(СмартДопФильтрыНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СмартДопФильтрыНоменклатуры.ПустаяСсылка))
			               |			ИНАЧЕ ВТТЗ.Значение
			               |		КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.СмартДопФильтрыНоменклатуры.ПустаяСсылка)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	смартЦветовыеКонфигурацииФильтрыНоменклатуры.Ссылка КАК ЦветоваяКонфигурация
			               |ИЗ
			               |	Справочник.смартЦветовыеКонфигурации.ФильтрыНоменклатуры КАК смартЦветовыеКонфигурацииФильтрыНоменклатуры
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначенияФильтров КАК ВТЗначенияФильтров
			               |		ПО смартЦветовыеКонфигурацииФильтрыНоменклатуры.Значение = ВТЗначенияФильтров.Значение
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	смартТехнологииПечати.Ссылка КАК ТехнологияПечати
			               |ИЗ
			               |	Справочник.смартТехнологииПечати.ФильтрыНоменклатуры КАК смартТехнологииПечати
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначенияФильтров КАК ВТЗначенияФильтров
			               |		ПО смартТехнологииПечати.Значение = ВТЗначенияФильтров.Значение
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	смартФорматыПринтеров.Ссылка КАК ФорматПринтера
			               |ИЗ
			               |	Справочник.смартФорматыПринтеров.ФильтрыНоменклатуры КАК смартФорматыПринтеров
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначенияФильтров КАК ВТЗначенияФильтров
			               |		ПО смартФорматыПринтеров.Значение = ВТЗначенияФильтров.Значение
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	смартШиринаПечати.Ссылка КАК ШиринаПечати
			               |ИЗ
			               |	Справочник.смартШиринаПечати.ФильтрыНоменклатуры КАК смартШиринаПечати
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначенияФильтров КАК ВТЗначенияФильтров
			               |		ПО смартШиринаПечати.Значение = ВТЗначенияФильтров.Значение";
			
			Пакет = Запрос.ВыполнитьПакет();
			
			Если НЕ Пакет[Пакет.Количество() - 4].Пустой() Тогда
				
				Выборка = Пакет[Пакет.Количество() - 4].Выбрать();
				Выборка.Следующий();
				НоваяСтрока = Объект.ЦветовыеСхемы.Добавить();
				НоваяСтрока.ЦветоваяСхема = Выборка.ЦветоваяКонфигурация;
				
			КонецЕсли;
			
			Если НЕ Пакет[Пакет.Количество() - 3].Пустой() Тогда
				
				Выборка = Пакет[Пакет.Количество() - 3].Выбрать();
				Выборка.Следующий();
				Объект.ТехнологияПечати = Выборка.ТехнологияПечати;
				
			КонецЕсли;
			
			Если НЕ Пакет[Пакет.Количество() - 2].Пустой() Тогда
				
				Выборка = Пакет[Пакет.Количество() - 2].Выбрать();
				Выборка.Следующий();
				Объект.ФорматПринтера = Выборка.ФорматПринтера;
				
			КонецЕсли;
			
			Если НЕ Пакет[Пакет.Количество() - 1].Пустой() Тогда
				
				Выборка = Пакет[Пакет.Количество() - 1].Выбрать();
				Выборка.Следующий();
				Объект.ШиринаПечати = Выборка.ШиринаПечати;
				
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
	КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ПолучитьПВХЧернила()));
	Элементы.РекомендуемыеЧернилаЧернила.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьАдресКартинки();
	
	//++ #Б-3688 смарт: Фролов 02.07.2025 //Доработка НСИ Конструктора КП. 
	ЭтаФорма.ОсновныеФишкиПоле = ТекущийОбъект.ОсновныеФишки.Получить();
	//-- #Б-3688 смарт: Фролов 02.07.2025
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ДанныеФайлаКартинки) ИЛИ ЗначениеЗаполнено(ДанныеФайлаКартинкиПечатающейГоловки) Тогда
		
		Если ЗначениеЗаполнено(ДанныеФайлаКартинки) Тогда
			
			ПараметрыФайлаКартинки = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайлаКартинки.Автор				= Пользователи.АвторизованныйПользователь();
			ПараметрыФайлаКартинки.ВладелецФайлов		= ТекущийОбъект.Ссылка;
			ПараметрыФайлаКартинки.ИмяБезРасширения		= ДанныеФайлаКартинки.ИмяБезРасширения;
			ПараметрыФайлаКартинки.РасширениеБезТочки	= ДанныеФайлаКартинки.Расширение;
			
			ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайлаКартинки, АдресКартинки);
			
			ТекущийОбъект.ФайлКартинки = ПрисоединенныйФайл;
			
			ДанныеФайлаКартинки = Неопределено;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеФайлаКартинкиПечатающейГоловки) Тогда
			
			ПараметрыФайлаКартинки = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайлаКартинки.Автор				= Пользователи.АвторизованныйПользователь();
			ПараметрыФайлаКартинки.ВладелецФайлов		= ТекущийОбъект.Ссылка;
			ПараметрыФайлаКартинки.ИмяБезРасширения		= ДанныеФайлаКартинкиПечатающейГоловки.ИмяБезРасширения;
			ПараметрыФайлаКартинки.РасширениеБезТочки	= ДанныеФайлаКартинкиПечатающейГоловки.Расширение;
			
			ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайлаКартинки, АдресКартинкиПечатающейГоловки);
			
			ТекущийОбъект.ФайлКартинкиПечатающейГоловки = ПрисоединенныйФайл;
			
			ДанныеФайлаКартинкиПечатающейГоловки = Неопределено;
			
		КонецЕсли;
		
		ТекущийОбъект.Записать();
		
		Прочитать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("смартЗаписанКонструкторОборудования", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) И ЗначениеЗаполнено(ТекущийОбъект.Номенклатура) И НЕ ЗначениеЗаполнено(ТекущийОбъект.Родитель) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка,
		|	ЭтоГруппа КАК ЭтоГруппа,
		|	Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номенклатура
		|ГДЕ
		|	Ссылка = &Ссылка
		|ИТОГИ ПО
		|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекущийРодитель = Справочники.смартКонструкторОборудования.ПустаяСсылка();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.смартКонструкторОборудования
		|ГДЕ
		|	Наименование = &Наименование
		|	И Родитель = &Родитель
		|	И ЭтоГруппа";
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ЭтоГруппа Тогда
				
				Запрос.УстановитьПараметр("Наименование", Выборка.Наименование);
				Запрос.УстановитьПараметр("Родитель", ТекущийРодитель);
				
				ВыборкаРодитель = Запрос.Выполнить().Выбрать();
				
				Если ВыборкаРодитель.Следующий() Тогда
					ТекущийРодитель = ВыборкаРодитель.Ссылка;
				Иначе
					
					НоваяГруппа = Справочники.смартКонструкторОборудования.СоздатьГруппу();
					НоваяГруппа.Наименование = Выборка.Наименование;
					НоваяГруппа.Родитель = ТекущийРодитель;
					НоваяГруппа.Записать();
					
					ТекущийРодитель = НоваяГруппа.Ссылка;
					
				КонецЕсли;
				
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		ТекущийОбъект.Родитель = ТекущийРодитель;
		
	КонецЕсли;
	
	//++ #Б-3688 смарт: Фролов 02.07.2025 //Доработка НСИ Конструктора КП.
	ТекущийОбъект.ОсновныеФишки = Новый ХранилищеЗначения(ЭтаФорма.ОсновныеФишкиПоле);
	//-- #Б-3688 смарт: Фролов 02.07.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда
	
		Если ИсточникВыбора.ИмяФормы = "Справочник.смартВидыМатериалов.Форма.ФормаВыбора" Тогда
			
			Для каждого стрМатериал Из ВыбранноеЗначение Цикл
				
				Если Объект.Материалы.НайтиСтроки(Новый Структура("Материал", стрМатериал)).Количество() = 0 Тогда
					НоваяСтрока = Объект.Материалы.Добавить();
					НоваяСтрока.Материал = стрМатериал;
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.смартПроизводимаяПродукция.Форма.ФормаВыбора" Тогда
			
			Для каждого стрПрименение Из ВыбранноеЗначение Цикл
				
				Если Объект.Применения.НайтиСтроки(Новый Структура("Применяется", стрПрименение)).Количество() = 0 Тогда
					НоваяСтрока = Объект.Применения.Добавить();
					НоваяСтрока.Применяется = стрПрименение;
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.СмартДопФильтрыНоменклатуры.ФормаВыбора" Тогда
			
			Для каждого стрЧернила Из ВыбранноеЗначение Цикл
				
				Если Объект.РекомендуемыеЧернила.НайтиСтроки(Новый Структура("Чернила", стрЧернила)).Количество() = 0 Тогда
					НоваяСтрока = Объект.РекомендуемыеЧернила.Добавить();
					НоваяСтрока.Чернила = стрЧернила;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроверяемыйРеквизит = "АдресКартинки";
	Если Элемент.Имя = "ФайлКартинкиПечатающейГоловки" Тогда
		ПроверяемыйРеквизит = "АдресКартинкиПечатающейГоловки";
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтаФорма[ПроверяемыйРеквизит]) Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
		ПриДобавленииИзображения(Элемент.Имя);
	Иначе
		ТекстСообщения = НСтр("ru='Отсутствует изображение для просмотра'");
		
		ПросмотретьПрисоединенныйФайл(Элемент.Имя, ПроверяемыйРеквизит, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяКонфигурацияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОборудованияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура БрендПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ТехническиеХарактеристикиСвойствоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТехническиеХарактеристики.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПривестиЗначениеКТипуТехническихХарактеристик(ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	Если Команда.Имя = "ДобавитьИзображение" Тогда
		ИмяЭлемента = "ФайлКартинки";
	ИначеЕсли Команда.Имя = "ДобавитьИзображениеПечатающейГоловки" Тогда
		ИмяЭлемента = "ФайлКартинкиПечатающейГоловки";
	КонецЕсли;
		
	ПриДобавленииИзображения(ИмяЭлемента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИзображение(Команда)
	
	Если Команда.Имя = "ОчиститьИзображение" Тогда
		
		Объект.ФайлКартинки = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
		ДанныеФайлаКартинки = Неопределено;
		
	ИначеЕсли Команда.Имя = "ОчиститьИзображениеПечатающейГоловки" Тогда
		
		Объект.ФайлКартинкиПечатающейГоловки = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
		ДанныеФайлаКартинкиПечатающейГоловки = Неопределено;
	
	КонецЕсли;
	
	ОбновитьАдресКартинки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьИзображение(Команда)
	
	ТекстСообщения = НСтр("ru='Отсутствует изображение для просмотра'");
	
	Если Команда.Имя = "ПросмотретьИзображение" Тогда
		
		ИмяЭлемента = "ФайлКартинки";
		ИмяРеквизита = "АдресКартинки";
		
	ИначеЕсли Команда.Имя = "ПросмотретьИзображениеПечатающейГоловки" Тогда
		
		ИмяЭлемента = "ФайлКартинкиПечатающейГоловки";
		ИмяРеквизита = "АдресКартинкиПечатающейГоловки";
		
	КонецЕсли;
	
	ПросмотретьПрисоединенныйФайл(ИмяЭлемента, ИмяРеквизита, ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИзображение(Команда)
	
	ОчиститьСообщения();
	
	Если Команда.Имя = "ИзменитьИзображение" Тогда
		
		ИмяЭлемента = "ФайлКартинки";
		ИмяРеквизита = "АдресКартинки";
		
	ИначеЕсли Команда.Имя = "ИзменитьИзображениеПечатающейГоловки" Тогда
		
		ИмяЭлемента = "ФайлКартинкиПечатающейГоловки";
		ИмяРеквизита = "АдресКартинкиПечатающейГоловки";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФайлКартинки) Тогда
		РаботаСФайламиКлиент.ОткрытьФормуФайла(Объект[ИмяЭлемента]);
	Иначе
		ТекстСообщения = НСтр("ru='Отсутствует изображение для редактирования'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ИмяРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинкуИзПрисоединенныхФайлов(Команда)
	
	Если Команда.Имя = "ВыбратьКартинкуИзПрисоединенныхФайлов" Тогда
		ИмяЭлемента = "ФайлКартинки";
	ИначеЕсли Команда.Имя = "ВыбратьКартинкуИзПрисоединенныхФайловПечатающейГоловки" Тогда
		ИмяЭлемента = "ФайлКартинкиПечатающейГоловки";
	КонецЕсли;
	
	СтруктураПараметрыВыбора =
		Новый Структура("ВладелецФайла, ЗакрыватьПриВыборе, РежимВыбора", Объект.Ссылка, Истина, Истина);

	ОткрытьФорму(
		"Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
		СтруктураПараметрыВыбора,,,,,
		Новый ОписаниеОповещения("ВыбратьКартинкуИзПрисоединенныхФайловЗавершение", ЭтотОбъект, Новый Структура("ИмяЭлемента", ИмяЭлемента)),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинкуИзПрисоединенныхФайловЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект[ДополнительныеПараметры.ИмяЭлемента] = Результат;
		
		ОбновитьАдресКартинки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеФайлаНеПрисоединенноЗавершение(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита] = Новый Структура("ПолноеИмя, ИмяБезРасширения, Расширение");
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПомещенныйФайл.Имя);
	
	ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита].ПолноеИмя		= СтруктураИмениФайла.Имя;
	ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита].ИмяБезРасширения	= СтруктураИмениФайла.ИмяБезРасширения;
	ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита].Расширение		= ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(
																		СтруктураИмениФайла.Расширение);
	
	Если ДополнительныеПараметры.ИмяРеквизита = "ДанныеФайлаКартинки" Тогда
		АдресКартинки = ПомещенныйФайл.Хранение;
	ИначеЕсли ДополнительныеПараметры.ИмяРеквизита = "ДанныеФайлаКартинкиПечатающейГоловки" Тогда
		АдресКартинкиПечатающейГоловки = ПомещенныйФайл.Хранение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	СсылкаНаФайл = ВыбранныеФайлы[0];
	
	Если ДополнительныеПараметры.ВыборИзображения Тогда
		
		Объект[ДополнительныеПараметры.ИмяЭлемента] = СсылкаНаФайл;
		ОбновитьАдресКартинки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборМатериалов(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе", Истина, Ложь);
	ОткрытьФорму("Справочник.смартВидыМатериалов.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПрименений(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе", Истина, Ложь);
	ОткрытьФорму("Справочник.смартПроизводимаяПродукция.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТХИзНоменклатуры(Команда)
	
	ЗаполнитьТХИзНоменклатурыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТХИзУказаннойКарточки(Команда)
	
	ОписаниеОповещение = Новый ОписаниеОповещения("ЗаполнитьТХИзУказаннойКарточкиЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.смартКонструкторОборудования.ФормаВыбора",, ЭтаФорма,,,, ОписаниеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТХИзУказаннойКарточкиЗавершение(Значение, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		ЗаполнитьТХИзУказаннойКарточкиСервер(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РекомендуемыеЧернилаПодбор(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе", Истина, Ложь);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", ПолучитьПВХЧернила()));
	ОткрытьФорму("Справочник.СмартДопФильтрыНоменклатуры.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.СтраницаДополнительныеОпции.Видимость = Объект.ОсновнаяКонфигурация;
	Элементы.СтраницаОформлениеКП.Видимость = Объект.ОсновнаяКонфигурация;
	Элементы.СтраницаПолезныеМатериалы.Видимость = Объект.ОсновнаяКонфигурация;
	
	//++ #Б-3044 смарт: Фролов 10.04.2025 //Доработки справочников НСИ - Конструктора КП
	//Элементы.ГруппаОсновнаяЛеваяКолонка.Видимость = (Объект.ОсновнаяКонфигурация 
	//												 И Объект.ВидОборудования = Справочники.смартВидыОборудования.ДляПечати);
	//												 
	//Элементы.СтраницаПечатающиеГоловки.Видимость = (Объект.ОсновнаяКонфигурация 
	//												 И Объект.ВидОборудования = Справочники.смартВидыОборудования.ДляПечати
	//												 И Объект.Бренд = Справочники.смартПредопределенныеЗначения.Настройки.БрендСпринтер);
	//-- #Б-3044 смарт: Фролов 10.04.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ПриДобавленииИзображения(ИмяЭлемента)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПараметрыОповещения	= Новый Структура("ИмяРеквизита", "ДанныеФайлаКартинки");
		ПараметрыОповещения.Вставить("ИмяЭлемента", ИмяЭлемента);
		ОписаниеОповещения	= Новый ОписаниеОповещения("ДобавлениеФайлаНеПрисоединенноЗавершение",
														ЭтотОбъект,
														ПараметрыОповещения);
		
		ПараметрыЗагрузкиФайла = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
		ПараметрыЗагрузкиФайла.Диалог.Фильтр = НоменклатураКлиент.ФильтрФайловИзображений();
		
		ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузкиФайла);
		
	Иначе
		
		ПараметрыОповещения	= Новый Структура("ВыборИзображения, ВыборФайлаОписания", Истина, Ложь);
		ПараметрыОповещения.Вставить("ИмяЭлемента", ИмяЭлемента);
		ОписаниеОповещения	= Новый ОписаниеОповещения("ДобавлениеФайлаЗавершение",
														ЭтотОбъект,
														ПараметрыОповещения);
		
		РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка,
											УникальныйИдентификатор,
											НоменклатураКлиент.ФильтрФайловИзображений(),
											,
											ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл(ИмяРеквизитаОбъекта, ИмяРеквизитаФормы, ТекстСообщенияОбОшибке)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если ЗначениеЗаполнено(Объект[ИмяРеквизитаОбъекта]) Тогда
			РаботаСФайламиКлиент.ОткрытьФайл(РаботаСФайламиКлиент.ДанныеФайла(Объект[ИмяРеквизитаОбъекта],
																				УникальныйИдентификатор));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке, , ИмяРеквизитаФормы);
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизитаФормы]) Тогда
			
			Если ИмяРеквизитаФормы = "АдресКартинки" Тогда
				РасположениеФайла	= АдресКартинки;
				ИмяФайла			= ?(ТипЗнч(ДанныеФайлаКартинки) = Тип("Структура"),
										ДанныеФайлаКартинки.ПолноеИмя,
										"");
			ИначеЕсли ИмяРеквизитаФормы = "АдресКартинкиПечатающейГоловки" Тогда
				РасположениеФайла	= АдресКартинкиПечатающейГоловки;
				ИмяФайла			= ?(ТипЗнч(ДанныеФайлаКартинкиПечатающейГоловки) = Тип("Структура"),
										ДанныеФайлаКартинкиПечатающейГоловки.ПолноеИмя,
										"");
			КонецЕсли;
			ФайловаяСистемаКлиент.ОткрытьФайл(РасположениеФайла, ,ИмяФайла);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке, , ИмяРеквизитаФормы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАдресКартинки()
	
	Если Объект.ФайлКартинки.Пустая() Тогда
		АдресКартинки = "";
		ПриПолученииДанныхКартинкиВозниклаОшибка = Ложь;
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			АдресКартинки = РаботаСФайлами.ДанныеФайла(Объект.ФайлКартинки, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		Исключение
			АдресКартинки = "";
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если Объект.ФайлКартинкиПечатающейГоловки.Пустая() Тогда
		АдресКартинкиПечатающейГоловки = "";
		ПриПолученииДанныхКартинкиВозниклаОшибка = Ложь;
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			АдресКартинкиПечатающейГоловки = РаботаСФайлами.ДанныеФайла(Объект.ФайлКартинкиПечатающейГоловки, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		Исключение
			АдресКартинкиПечатающейГоловки = "";
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПривестиЗначениеКТипуТехническихХарактеристик(ИДСтроки)
	
	Данные = Объект.ТехническиеХарактеристики.НайтиПоИдентификатору(ИДСтроки);
	Данные.Значение = Данные.Свойство.ТипЗначения.ПривестиЗначение(Данные.Значение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТХИзНоменклатурыСервер()
	
	Объект.ТехническиеХарактеристики.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СмартЗначенияСвойствФильтров.ВидСвойств КАК Свойство,
	|	СмартЗначенияСвойствФильтров.Значение КАК Значение,
	|	СмартЗначенияСвойствФильтров.ЗначениеСтрока КАК ЗначениеСтрока,
	|	СмартЗначенияСвойствФильтров.ВидСвойств.Множественное КАК Множественное
	|ИЗ
	|	РегистрСведений.СмартЗначенияСвойствФильтров КАК СмартЗначенияСвойствФильтров
	|ГДЕ
	|	СмартЗначенияСвойствФильтров.НаборСвойств = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Множественное Тогда
			
			МассивЗначений = СтрРазделить(Выборка.ЗначениеСтрока, ";");
			Для каждого стрЗначение Из МассивЗначений Цикл
				
				НоваяСтрока = Объект.ТехническиеХарактеристики.Добавить();
				НоваяСтрока.Свойство = Выборка.Свойство;
				Попытка
					ИмяСправочника = Выборка.Свойство.ТипЗначения.ПривестиЗначение(0).Метаданные().Имя;
					НоваяСтрока.Значение = Справочники[ИмяСправочника].НайтиПоНаименованию(стрЗначение, Истина,, Выборка.Свойство);
				Исключение
					НоваяСтрока.Значение = стрЗначение;
				КонецПопытки;
				
				Если НеЗаполнятьПустыеТХ И НЕ ЗначениеЗаполнено(НоваяСтрока.Значение) Тогда
					Объект.ТехническиеХарактеристики.Удалить(НоваяСтрока);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Если НеЗаполнятьПустыеТХ И НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.ТехническиеХарактеристики.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТХИзУказаннойКарточкиСервер(Конструктор)
	
	Объект.ТехническиеХарактеристики.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартКонструкторОборудованияТехническиеХарактеристики.Свойство КАК Свойство,
	|	смартКонструкторОборудованияТехническиеХарактеристики.Значение КАК Значение
	|ИЗ
	|	Справочник.смартКонструкторОборудования.ТехническиеХарактеристики КАК смартКонструкторОборудованияТехническиеХарактеристики
	|ГДЕ
	|	смартКонструкторОборудованияТехническиеХарактеристики.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Конструктор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НеЗаполнятьПустыеТХ И НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.ТехническиеХарактеристики.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПВХЧернила()
	
	Возврат ПланыВидовХарактеристик.СмартФильтрыНоменклатуры.НайтиПоКоду("000000004");
	
КонецФункции

#КонецОбласти
